In [1]:
import pandas as pd

#### 构建DataFrame结构

In [2]:
data = {'country': ['aaa', 'bbb', 'ccc'], 'population': [10, 20, 30]}
df = pd.DataFrame(data)

In [3]:
df

  country  population
0     aaa          10
1     bbb          20
2     ccc          30

### 从csv文件读取数据

In [3]:
df = pd.read_csv('./data/titanic_train.csv')

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### 查看前几行数据

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### 查看数据的基本信息

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
df.index

RangeIndex(start=0, stop=891, step=1)

#### 查看数据的所有列名

In [8]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### 查看数据类型

In [9]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

#### 查看某列的值

In [10]:
age = df['Age']

In [11]:
age[:5]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

#### Age列的数据类型

In [12]:
type(age)

pandas.core.series.Series

In [13]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [14]:
age.values

array([22.  , 38.  , 26.  , 35.  , 35.  ,   nan, 54.  ,  2.  , 27.  ,
       14.  ,  4.  , 58.  , 20.  , 39.  , 14.  , 55.  ,  2.  ,   nan,
       31.  ,   nan, 35.  , 34.  , 15.  , 28.  ,  8.  , 38.  ,   nan,
       19.  ,   nan,   nan, 40.  ,   nan,   nan, 66.  , 28.  , 42.  ,
         nan, 21.  , 18.  , 14.  , 40.  , 27.  ,   nan,  3.  , 19.  ,
         nan,   nan,   nan,   nan, 18.  ,  7.  , 21.  , 49.  , 29.  ,
       65.  ,   nan, 21.  , 28.5 ,  5.  , 11.  , 22.  , 38.  , 45.  ,
        4.  ,   nan,   nan, 29.  , 19.  , 17.  , 26.  , 32.  , 16.  ,
       21.  , 26.  , 32.  , 25.  ,   nan,   nan,  0.83, 30.  , 22.  ,
       29.  ,   nan, 28.  , 17.  , 33.  , 16.  ,   nan, 23.  , 24.  ,
       29.  , 20.  , 46.  , 26.  , 59.  ,   nan, 71.  , 23.  , 34.  ,
       34.  , 28.  ,   nan, 21.  , 33.  , 37.  , 28.  , 21.  ,   nan,
       38.  ,   nan, 47.  , 14.5 , 22.  , 20.  , 17.  , 21.  , 70.5 ,
       29.  , 24.  ,  2.  , 21.  ,   nan, 32.5 , 32.5 , 54.  , 12.  ,
         nan, 24.  ,   nan, 45.  , 33.  , 20.  , 47.  , 29.  , 25.  ,
       23.  , 19.  , 37.  , 16.  , 24.  ,   nan, 22.  , 24.  , 19.  ,
       18.  , 19.  , 27.  ,  9.  , 36.5 , 42.  , 51.  , 22.  , 55.5 ,
       40.5 ,   nan, 51.  , 16.  , 30.  ,   nan,   nan, 44.  , 40.  ,
       26.  , 17.  ,  1.  ,  9.  ,   nan, 45.  ,   nan, 28.  , 61.  ,
        4.  ,  1.  , 21.  , 56.  , 18.  ,   nan, 50.  , 30.  , 36.  ,
         nan,   nan,  9.  ,  1.  ,  4.  ,   nan,   nan, 45.  , 40.  ,
       36.  , 32.  , 19.  , 19.  ,  3.  , 44.  , 58.  ,   nan, 42.  ,
         nan, 24.  , 28.  ,   nan, 34.  , 45.5 , 18.  ,  2.  , 32.  ,
       26.  , 16.  , 40.  , 24.  , 35.  , 22.  , 30.  ,   nan, 31.  ,
       27.  , 42.  , 32.  , 30.  , 16.  , 27.  , 51.  ,   nan, 38.  ,
       22.  , 19.  , 20.5 , 18.  ,   nan, 35.  , 29.  , 59.  ,  5.  ,
       24.  ,   nan, 44.  ,  8.  , 19.  , 33.  ,   nan,   nan, 29.  ,
       22.  , 30.  , 44.  , 25.  , 24.  , 37.  , 54.  ,   nan, 29.  ,
       62.  , 30.  , 41.  , 29.  ,   nan, 30.  , 35.  , 50.  ,   nan,
        3.  , 52.  , 40.  ,   nan, 36.  , 16.  , 25.  , 58.  , 35.  ,
         nan, 25.  , 41.  , 37.  ,   nan, 63.  , 45.  ,   nan,  7.  ,
       35.  , 65.  , 28.  , 16.  , 19.  ,   nan, 33.  , 30.  , 22.  ,
       42.  , 22.  , 26.  , 19.  , 36.  , 24.  , 24.  ,   nan, 23.5 ,
        2.  ,   nan, 50.  ,   nan,   nan, 19.  ,   nan,   nan,  0.92,
         nan, 17.  , 30.  , 30.  , 24.  , 18.  , 26.  , 28.  , 43.  ,
       26.  , 24.  , 54.  , 31.  , 40.  , 22.  , 27.  , 30.  , 22.  ,
         nan, 36.  , 61.  , 36.  , 31.  , 16.  ,   nan, 45.5 , 38.  ,
       16.  ,   nan,   nan, 29.  , 41.  , 45.  , 45.  ,  2.  , 24.  ,
       28.  , 25.  , 36.  , 24.  , 40.  ,   nan,  3.  , 42.  , 23.  ,
         nan, 15.  , 25.  ,   nan, 28.  , 22.  , 38.  ,   nan,   nan,
       40.  , 29.  , 45.  , 35.  ,   nan, 30.  , 60.  ,   nan,   nan,
       24.  , 25.  , 18.  , 19.  , 22.  ,  3.  ,   nan, 22.  , 27.  ,
       20.  , 19.  , 42.  ,  1.  , 32.  , 35.  ,   nan, 18.  ,  1.  ,
       36.  ,   nan, 17.  , 36.  , 21.  , 28.  , 23.  , 24.  , 22.  ,
       31.  , 46.  , 23.  , 28.  , 39.  , 26.  , 21.  , 28.  , 20.  ,
       34.  , 51.  ,  3.  , 21.  ,   nan,   nan,   nan, 33.  ,   nan,
       44.  ,   nan, 34.  , 18.  , 30.  , 10.  ,   nan, 21.  , 29.  ,
       28.  , 18.  ,   nan, 28.  , 19.  ,   nan, 32.  , 28.  ,   nan,
       42.  , 17.  , 50.  , 14.  , 21.  , 24.  , 64.  , 31.  , 45.  ,
       20.  , 25.  , 28.  ,   nan,  4.  , 13.  , 34.  ,  5.  , 52.  ,
       36.  ,   nan, 30.  , 49.  ,   nan, 29.  , 65.  ,   nan, 50.  ,
         nan, 48.  , 34.  , 47.  , 48.  ,   nan, 38.  ,   nan, 56.  ,
         nan,  0.75,   nan, 38.  , 33.  , 23.  , 22.  ,   nan, 34.  ,
       29.  , 22.  ,  2.  ,  9.  ,   nan, 50.  , 63.  , 25.  ,   nan,
       35.  , 58.  , 30.  ,  9.  ,   nan, 21.  , 55.  , 71.  , 21.  ,
         nan, 54.  ,   nan, 25.  , 24.  , 17.  , 21.  ,   nan, 37.  ,
       16.  , 18.  , 33.  ,   nan, 28.  , 26.  , 29.  ,   nan, 36.  ,
       54.  , 24.  , 47.  , 34.  ,   nan, 36.  , 32.  , 30.  , 22.  ,
         nan, 44.  ,   nan, 40.5 , 50.  ,   nan, 39.  , 23.  ,  2.  ,
         nan, 17.  ,   nan, 30.  ,  7.  , 45.  , 30.  ,   nan, 22.  ,
       36.  ,  9.  , 11.  , 32.  , 50.  , 64.  , 19.  ,   nan, 33.  ,
        8.  , 17.  , 27.  ,   nan, 22.  , 22.  , 62.  , 48.  ,   nan,
       39.  , 36.  ,   nan, 40.  , 28.  ,   nan,   nan, 24.  , 19.  ,
       29.  ,   nan, 32.  , 62.  , 53.  , 36.  ,   nan, 16.  , 19.  ,
       34.  , 39.  ,   nan, 32.  , 25.  , 39.  , 54.  , 36.  ,   nan,
       18.  , 47.  , 60.  , 22.  ,   nan, 35.  , 52.  , 47.  ,   nan,
       37.  , 36.  ,   nan, 49.  ,   nan, 49.  , 24.  ,   nan,   nan,
       44.  , 35.  , 36.  , 30.  , 27.  , 22.  , 40.  , 39.  ,   nan,
         nan,   nan, 35.  , 24.  , 34.  , 26.  ,  4.  , 26.  , 27.  ,
       42.  , 20.  , 21.  , 21.  , 61.  , 57.  , 21.  , 26.  ,   nan,
       80.  , 51.  , 32.  ,   nan,  9.  , 28.  , 32.  , 31.  , 41.  ,
         nan, 20.  , 24.  ,  2.  ,   nan,  0.75, 48.  , 19.  , 56.  ,
         nan, 23.  ,   nan, 18.  , 21.  ,   nan, 18.  , 24.  ,   nan,
       32.  , 23.  , 58.  , 50.  , 40.  , 47.  , 36.  , 20.  , 32.  ,
       25.  ,   nan, 43.  ,   nan, 40.  , 31.  , 70.  , 31.  ,   nan,
       18.  , 24.5 , 18.  , 43.  , 36.  ,   nan, 27.  , 20.  , 14.  ,
       60.  , 25.  , 14.  , 19.  , 18.  , 15.  , 31.  ,  4.  ,   nan,
       25.  , 60.  , 52.  , 44.  ,   nan, 49.  , 42.  , 18.  , 35.  ,
       18.  , 25.  , 26.  , 39.  , 45.  , 42.  , 22.  ,   nan, 24.  ,
         nan, 48.  , 29.  , 52.  , 19.  , 38.  , 27.  ,   nan, 33.  ,
        6.  , 17.  , 34.  , 50.  , 27.  , 20.  , 30.  ,   nan, 25.  ,
       25.  , 29.  , 11.  ,   nan, 23.  , 23.  , 28.5 , 48.  , 35.  ,
         nan,   nan,   nan, 36.  , 21.  , 24.  , 31.  , 70.  , 16.  ,
       30.  , 19.  , 31.  ,  4.  ,  6.  , 33.  , 23.  , 48.  ,  0.67,
       28.  , 18.  , 34.  , 33.  ,   nan, 41.  , 20.  , 36.  , 16.  ,
       51.  ,   nan, 30.5 ,   nan, 32.  , 24.  , 48.  , 57.  ,   nan,
       54.  , 18.  ,   nan,  5.  ,   nan, 43.  , 13.  , 17.  , 29.  ,
         nan, 25.  , 25.  , 18.  ,  8.  ,  1.  , 46.  ,   nan, 16.  ,
         nan,   nan, 25.  , 39.  , 49.  , 31.  , 30.  , 30.  , 34.  ,
       31.  , 11.  ,  0.42, 27.  , 31.  , 39.  , 18.  , 39.  , 33.  ,
       26.  , 39.  , 35.  ,  6.  , 30.5 ,   nan, 23.  , 31.  , 43.  ,
       10.  , 52.  , 27.  , 38.  , 27.  ,  2.  ,   nan,   nan,  1.  ,
         nan, 62.  , 15.  ,  0.83,   nan, 23.  , 18.  , 39.  , 21.  ,
         nan, 32.  ,   nan, 20.  , 16.  , 30.  , 34.5 , 17.  , 42.  ,
         nan, 35.  , 28.  ,   nan,  4.  , 74.  ,  9.  , 16.  , 44.  ,
       18.  , 45.  , 51.  , 24.  ,   nan, 41.  , 21.  , 48.  ,   nan,
       24.  , 42.  , 27.  , 31.  ,   nan,  4.  , 26.  , 47.  , 33.  ,
       47.  , 28.  , 15.  , 20.  , 19.  ,   nan, 56.  , 25.  , 33.  ,
       22.  , 28.  , 25.  , 39.  , 27.  , 19.  ,   nan, 26.  , 32.  ])

#### DataFrame复制

In [15]:
a = df.copy()

#### 设置索引列

In [16]:
a.set_index('Name', inplace=True)

In [17]:
a

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",887,0,2,male,27.0,0,0,211536,13.0000,NaN,S
"Graham, Miss. Margaret Edith",888,1,1,female,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",889,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
"Behr, Mr. Karl Howell",890,1,1,male,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",891,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [18]:
a['Age'][:5]

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
Allen, Mr. William Henry                               35.0
Name: Age, dtype: float64

#### 根据名字获取年龄

In [20]:
age = a['Age']
age['Cumings, Mrs. John Bradley (Florence Briggs Thayer)']

38.0

#### 加法运算

In [21]:
age += 10

In [22]:
age[:5]

Name
Braund, Mr. Owen Harris                                32.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    48.0
Heikkinen, Miss. Laina                                 36.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           45.0
Allen, Mr. William Henry                               45.0
Name: Age, dtype: float64

#### 均值计算

In [23]:
age.mean()

39.69911764705882

#### 最大值

In [24]:
age.max()

90.0

#### 最小值

In [25]:
age.min()

10.42

#### DataFrame数据的基本统计情况
* 1、计数
* 2、均值
* 3、标准差
* 4、最小值
* 5、1/4位
* 6、1/2位
* 7、3/4位
* 8、最大值

In [26]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### DataFrame定位数据方法
* loc 用label索引定位
* iloc 用position索引定位

In [27]:
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [28]:
df.iloc[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### 取部分列的数据

In [29]:
df.iloc[0:5, 1:3]

   Survived  Pclass
0         0       3
1         1       1
2         1       3
3         1       1
4         0       3

#### 获取某人的数据

In [31]:
a.loc['Braund, Mr. Owen Harris']

PassengerId            1
Survived               0
Pclass                 3
Sex                 male
Age                   32
SibSp                  1
Parch                  0
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

#### 获取某人的某个属性

In [33]:
a.loc['Braund, Mr. Owen Harris', 'Fare']

7.25

#### 获取某两人之间的所有数据

In [34]:
a.loc['Braund, Mr. Owen Harris':'Allen, Mr. William Henry']

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,32.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,48.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,36.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,45.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,45.0,0,0,373450,8.0500,NaN,S

#### 赋值

In [35]:
a.loc['Braund, Mr. Owen Harris', 'Fare'] = 72.5

In [36]:
a.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,32.0,1,0,A/5 21171,72.5000,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,48.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,36.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,45.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,45.0,0,0,373450,8.0500,NaN,S

### Bool类型的索引

#### 船票大于40的人

In [37]:
a['Fare'] > 40

Name
Braund, Mr. Owen Harris                                 True
Cumings, Mrs. John Bradley (Florence Briggs Thayer)     True
Heikkinen, Miss. Laina                                 False
Futrelle, Mrs. Jacques Heath (Lily May Peel)            True
Allen, Mr. William Henry                               False
                                                       ...
Montvila, Rev. Juozas                                  False
Graham, Miss. Margaret Edith                           False
Johnston, Miss. Catherine Helen "Carrie"               False
Behr, Mr. Karl Howell                                  False
Dooley, Mr. Patrick                                    False
Name: Fare, Length: 891, dtype: bool

In [38]:
a[a['Fare']>40]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,32.0,1,0,A/5 21171,72.5000,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,48.0,1,0,PC 17599,71.2833,C85,C
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,45.0,1,0,113803,53.1000,C123,S
"McCarthy, Mr. Timothy J",7,0,1,male,64.0,0,0,17463,51.8625,E46,S
"Fortune, Mr. Charles Alexander",28,0,1,male,29.0,3,2,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...
"Wick, Mrs. George Dennick (Mary Hitchcock)",857,1,1,female,55.0,1,1,36928,164.8667,NaN,S
"Sage, Miss. Dorothy Edith ""Dolly""",864,0,3,female,NaN,8,2,CA. 2343,69.5500,NaN,S
"Roebling, Mr. Washington Augustus II",868,0,1,male,41.0,0,0,PC 17590,50.4958,A24,S
"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",872,1,1,female,57.0,1,1,11751,52.5542,D35,S
"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",880,1,1,female,66.0,0,1,11767,83.1583,C50,C

In [39]:
a[a['Sex'] == 'male'][:5]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,32.0,1,0,A/5 21171,72.5000,NaN,S
"Allen, Mr. William Henry",5,0,3,male,45.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,0,3,male,NaN,0,0,330877,8.4583,NaN,Q
"McCarthy, Mr. Timothy J",7,0,1,male,64.0,0,0,17463,51.8625,E46,S
"Palsson, Master. Gosta Leonard",8,0,3,male,12.0,3,1,349909,21.0750,NaN,S

#### 统计性别为男性的平均年龄

In [40]:
a.loc[a['Sex'] == 'male', 'Age'].mean()

40.726644591611475

#### 多条件: 与

In [44]:
a.loc[(a['Sex']=='male')&(a['Fare']>40)]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,32.0,1,0,A/5 21171,72.5000,NaN,S
"McCarthy, Mr. Timothy J",7,0,1,male,64.0,0,0,17463,51.8625,E46,S
"Fortune, Mr. Charles Alexander",28,0,1,male,29.0,3,2,19950,263.0000,C23 C25 C27,S
"Meyer, Mr. Edgar Joseph",35,0,1,male,38.0,1,0,PC 17604,82.1708,NaN,C
"Holverson, Mr. Alexander Oskar",36,0,1,male,52.0,1,0,113789,52.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
"Carter, Master. William Thornton II",803,1,1,male,21.0,1,2,113760,120.0000,B96 B98,S
"Lam, Mr. Len",827,0,3,male,NaN,0,0,1601,56.4958,NaN,S
"Chip, Mr. Chang",839,1,3,male,42.0,0,0,1601,56.4958,NaN,S
"Sage, Mr. Douglas Bullen",847,0,3,male,NaN,8,2,CA. 2343,69.5500,NaN,S
"Roebling, Mr. Washington Augustus II",868,0,1,male,41.0,0,0,PC 17590,50.4958,A24,S

#### 多条件: 或

In [45]:
a.loc[(a['Sex']=='male')|(a['Fare']>40)]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,32.0,1,0,A/5 21171,72.5000,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,48.0,1,0,PC 17599,71.2833,C85,C
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,45.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,45.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,0,3,male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...
"Banfield, Mr. Frederick James",884,0,2,male,38.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
"Sutehall, Mr. Henry Jr",885,0,3,male,35.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
"Montvila, Rev. Juozas",887,0,2,male,37.0,0,0,211536,13.0000,NaN,S
"Behr, Mr. Karl Howell",890,1,1,male,36.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",891,0,3,male,42.0,0,0,370376,7.7500,NaN,Q

#### 取反

In [47]:
a.loc[~(a['Sex']=='male')]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,48.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,36.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,45.0,1,0,113803,53.1000,C123,S
"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",9,1,3,female,37.0,0,2,347742,11.1333,NaN,S
"Nasser, Mrs. Nicholas (Adele Achem)",10,1,2,female,24.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
"Shelley, Mrs. William (Imanita Parrish Hall)",881,1,2,female,35.0,0,1,230433,26.0000,NaN,S
"Dahlberg, Miss. Gerda Ulrika",883,0,3,female,32.0,0,0,7552,10.5167,NaN,S
"Rice, Mrs. William (Margaret Norton)",886,0,3,female,49.0,0,5,382652,29.1250,NaN,Q
"Graham, Miss. Margaret Edith",888,1,1,female,29.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",889,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [48]:
a.loc[a['Sex']=='male']

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,32.0,1,0,A/5 21171,72.5000,NaN,S
"Allen, Mr. William Henry",5,0,3,male,45.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,0,3,male,NaN,0,0,330877,8.4583,NaN,Q
"McCarthy, Mr. Timothy J",7,0,1,male,64.0,0,0,17463,51.8625,E46,S
"Palsson, Master. Gosta Leonard",8,0,3,male,12.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
"Banfield, Mr. Frederick James",884,0,2,male,38.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
"Sutehall, Mr. Henry Jr",885,0,3,male,35.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
"Montvila, Rev. Juozas",887,0,2,male,37.0,0,0,211536,13.0000,NaN,S
"Behr, Mr. Karl Howell",890,1,1,male,36.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",891,0,3,male,42.0,0,0,370376,7.7500,NaN,Q

#### 分组

##### 按性别分组并求均值

In [49]:
df.groupby('Sex').mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

##### 各性别的平均年龄

In [51]:
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [53]:
d = pd.DataFrame([[1, 2, 3], [4, 5, 6]], index=['a', 'b'], columns=['A', 'B', 'C'])

In [54]:
d

   A  B  C
a  1  2  3
b  4  5  6

##### 按列求和

In [55]:
d.sum()

A    5
B    7
C    9
dtype: int64

##### 按行求和

In [57]:
d.sum(axis=1)

a     6
b    15
dtype: int64

##### 中值 / 平均值

In [58]:
d.median()

A    2.5
B    3.5
C    4.5
dtype: float64

##### 二元统计

##### 协方差

In [59]:
df.cov()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,66231.000000,-0.626966,-7.561798,138.696504,-16.325843,-0.342697,161.883369
Survived,-0.626966,0.236772,-0.137703,-0.551296,-0.018954,0.032017,6.221787
Pclass,-7.561798,-0.137703,0.699015,-4.496004,0.076599,0.012429,-22.830196
Age,138.696504,-0.551296,-4.496004,211.019125,-4.163334,-2.344191,73.849030
SibSp,-16.325843,-0.018954,0.076599,-4.163334,1.216043,0.368739,8.748734
Parch,-0.342697,0.032017,0.012429,-2.344191,0.368739,0.649728,8.661052
Fare,161.883369,6.221787,-22.830196,73.849030,8.748734,8.661052,2469.436846

##### 相关系数

In [60]:
df.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

##### 年龄统计计数

In [62]:
df['Age'].value_counts(ascending=True)

0.42      1
23.50     1
66.00     1
70.50     1
55.50     1
         ..
30.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: Age, Length: 88, dtype: int64

In [63]:
df['Pclass'].value_counts(ascending=True)

2    184
1    216
3    491
Name: Pclass, dtype: int64

##### 年龄统计数据分组

In [64]:
df['Age'].value_counts(ascending=True, bins=5)

(64.084, 80.0]       11
(48.168, 64.084]     69
(0.339, 16.336]     100
(32.252, 48.168]    188
(16.336, 32.252]    346
Name: Age, dtype: int64

##### 索引/列 重命名

In [65]:
d.rename(index={'a': 'f', 'b': 's'}, inplace=True)

In [66]:
d

   A  B  C
f  1  2  3
s  4  5  6

##### 添加数据

In [78]:
s2 = pd.DataFrame([[7, 8, 9], [10, 1, 12]], index=['a', 'b'], columns=['A', 'B', 'C'])

In [79]:
s2

    A  B   C
a   7  8   9
b  10  1  12

In [81]:
f = d.append(s2)

In [82]:
f

    A  B   C
f   1  2   3
s   4  5   6
a   7  8   9
b  10  1  12

In [84]:
f.loc['a']

A    7
B    8
C    9
Name: a, dtype: int64

In [86]:
f.drop(index=['a'], inplace=True)

In [87]:
f

    A  B   C
f   1  2   3
s   4  5   6
b  10  1  12

#### merge操作

In [89]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'], 'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'], 'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']})

In [91]:
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [101]:
left = pd.DataFrame(
    {
        'key1': ['K0', 'K1', 'K2', 'K3'], 
        'key2': ['K0', 'K1', 'K2', 'K3'],
        'A': ['A0', 'A1', 'A2', 'A3'],
        'B': ['B0', 'B1', 'B2', 'B3']
    }
)

right = pd.DataFrame(
    {
        'key1': ['K0', 'K1', 'K2', 'K3'], 
        'key2': ['K0', 'K1', 'K2', 'K3'],
        'C': ['C0', 'C1', 'C2', 'C3'], 
        'D': ['D0', 'D1', 'D2', 'D3']
    }
)

In [102]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K2  A2  B2  C2  D2
3   K3   K3  A3  B3  C3  D3

In [112]:
left = pd.DataFrame(
    {
        'key1': ['K0', 'K1', 'K2', 'K3'], 
        'key2': ['K0', 'K1', 'K2', 'K3'],
        'A': ['A0', 'A1', 'A2', 'A3'],
        'B': ['B0', 'B1', 'B2', 'B3']
    }
)

right = pd.DataFrame(
    {
        'key1': ['K0', 'K1', 'K2', 'K3'], 
        'key2': ['K0', 'K1', 'K2', 'K4'],
        'C': ['C0', 'C1', 'C2', 'C3'], 
        'D': ['D0', 'D1', 'D2', 'D3']
    }
)

In [113]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K2  A2  B2  C2  D2

In [114]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K1   K1   A1   B1   C1   D1
2   K2   K2   A2   B2   C2   D2
3   K3   K3   A3   B3  NaN  NaN
4   K3   K4  NaN  NaN   C3   D3

In [115]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K1   K1  A1  B1   C1   D1
2   K2   K2  A2  B2   C2   D2
3   K3   K3  A3  B3  NaN  NaN

In [116]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K1   A1   B1  C1  D1
2   K2   K2   A2   B2  C2  D2
3   K3   K4  NaN  NaN  C3  D3

In [117]:
pd.merge(left, right, how='left', left_on=['key1', 'key2'], right_on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K1   K1  A1  B1   C1   D1
2   K2   K2  A2  B2   C2   D2
3   K3   K3  A3  B3  NaN  NaN

In [118]:
left = pd.DataFrame(
    {
        'key1': ['K0', 'K1', 'K2', 'K3'], 
        'A': ['A0', 'A1', 'A2', 'A3'],
        'B': ['B0', 'B1', 'B2', 'B3']
    }
)

right = pd.DataFrame(
    {
        'key': ['K0', 'K1', 'K2', 'K4'],
        'C': ['C0', 'C1', 'C2', 'C3'], 
        'D': ['D0', 'D1', 'D2', 'D3']
    }
)

In [119]:
pd.merge(left, right, left_on='key1', right_on='key')

  key1   A   B key   C   D
0   K0  A0  B0  K0  C0  D0
1   K1  A1  B1  K1  C1  D1
2   K2  A2  B2  K2  C2  D2

In [120]:
pd.merge(left, right, how='outer', left_on='key1', right_on='key')

  key1    A    B  key    C    D
0   K0   A0   B0   K0   C0   D0
1   K1   A1   B1   K1   C1   D1
2   K2   A2   B2   K2   C2   D2
3   K3   A3   B3  NaN  NaN  NaN
4  NaN  NaN  NaN   K4   C3   D3

#### pandas显示设置

##### 查看最大显示行数

In [123]:
pd.get_option('display.max_rows')

60

##### 设置最大显示行数

In [ ]:
pd.set_option('display.max_rows', 120)

##### 查看最大显示列数

In [125]:
pd.get_option('display.max_columns')

20

In [126]:
pd.set_option('display.max_columns', 30)

##### 查看网格的最大宽度

In [124]:
pd.get_option('display.max_colwidth')

50

##### 设置精度

In [128]:
pd.get_option('display.precision')

6

In [129]:
pd.set_option('display.precision', 10)

#### pandas 数据透视表

In [130]:
execl_sample = pd.DataFrame(
    {
        'Month': [
            'January', 'January', 'January', 'January',
            'February', 'February', 'February', 'February',
            'March', 'March', 'March', 'March'
        ],
        'Category': [
            'Transportation', 'Grocery', 'Household', 'Entertainment',
             'Transportation', 'Grocery', 'Household', 'Entertainment',
             'Transportation', 'Grocery', 'Household', 'Entertainment',
        ],
        'Amount': [
            74., 235., 175., 100., 
            115., 240., 225., 125.,
            90., 260., 200., 120.
        ]
    }
)

In [131]:
execl_sample.head()

      Month        Category  Amount
0   January  Transportation    74.0
1   January         Grocery   235.0
2   January       Household   175.0
3   January   Entertainment   100.0
4  February  Transportation   115.0

In [134]:
example_pivot = execl_sample.pivot(index='Category', columns='Month', values='Amount')

In [135]:
example_pivot

Month           February  January  March
Category
Entertainment      125.0    100.0  120.0
Grocery            240.0    235.0  260.0
Household          225.0    175.0  200.0
Transportation     115.0     74.0   90.0

In [140]:
example = pd.DataFrame(
    {
        "A": ["foo", "foo", "foo", "foo", "foo", "bar", "bar", "bar", "bar"], 
        "B": ["one", "one", "one", "two", "two", "one", "one", "two", "two"], 
        "C": ["small", "large", "large", "small", "small", "large", "small", "small", "large"], 
        "D": [1, 2, 2, 3, 3, 4, 5, 6, 7], 
        "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]
    }
)

In [155]:
table = example.pivot_table(index=['A', 'B'], columns=['C'], values='D')

In [156]:
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    2.0    1.0
    two    NaN    3.0

##### 泰坦尼克数据统计: 不同性别，不同等级之间的船票平均价格, 存活率

In [161]:
df.pivot_table(index=['Sex'], columns=['Pclass'], values=['Fare', 'Survived'])

                  Fare                                    Survived  \
Pclass               1              2              3             1
Sex
female  106.1257978723  21.9701210526  16.1188097222  0.9680851064
male     67.2261270492  19.7417824074  12.6616325648  0.3688524590


Pclass             2             3
Sex
female  0.9210526316  0.5000000000
male    0.1574074074  0.1354466859

##### 泰坦尼克数据统计: 不同性别，不同等级之间的船票总价格, 存活率

In [162]:
df.pivot_table(index=['Sex'], columns=['Pclass'], values=['Fare', 'Survived'], aggfunc='sum')

             Fare                       Survived
Pclass          1          2          3        1   2   3
Sex
female  9975.8250  1669.7292  2321.1086       91  70  72
male    8201.5875  2132.1125  4393.5865       45  17  47

In [163]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### 统计不同等级的船舱男女获救、死亡的数量

In [180]:
df.pivot_table(index=['Pclass', 'Sex'], columns=['Survived'], values='Fare', aggfunc='count')

Survived         0   1
Pclass Sex
1      female    3  91
       male     77  45
2      female    6  70
       male     91  17
3      female   72  72
       male    300  47

#### 不同等级的船舱的人数统计

In [173]:
df.groupby('Pclass')['Name'].count()

Pclass
1    216
2    184
3    491
Name: Name, dtype: int64

#### 各船舱男女数量统计

In [175]:
pd.crosstab(index=df['Pclass'], columns=df['Sex'])

Sex     female  male
Pclass
1           94   122
2           76   108
3          144   347

In [181]:
df.pivot_table(index=['Pclass'], columns=['Sex'], values='Name', aggfunc='count')

Sex     female  male
Pclass
1           94   122
2           76   108
3          144   347

#### 时间操作

In [3]:
import datetime

In [4]:
dt = datetime.datetime(year=2017, month=11, day=24, hour=10, minute=30)

In [6]:
print(dt)

2017-11-24 10:30:00

In [7]:
ts = pd.Timestamp('2021-01-20')

In [8]:
ts

Timestamp('2021-01-20 00:00:00')

In [9]:
ts.day

20

In [10]:
ts.year

2021

In [11]:
ts + pd.Timedelta('5 days')

Timestamp('2021-01-25 00:00:00')

In [12]:
pd.to_datetime('2021-01-20')

Timestamp('2021-01-20 00:00:00')

In [13]:
s = pd.Series(
    ['2021-01-20', '2021-01-19', '2021-01-18']
)

In [14]:
s

0    2021-01-20
1    2021-01-19
2    2021-01-18
dtype: object

In [15]:
ts = pd.to_datetime(s)

In [16]:
ts

0   2021-01-20
1   2021-01-19
2   2021-01-18
dtype: datetime64[ns]

In [17]:
ts.dt.hour

0    0
1    0
2    0
dtype: int64

In [18]:
ts.dt.weekday

0    2
1    1
2    0
dtype: int64

In [19]:
ts.dt.week

0    3
1    3
2    3
dtype: int64

In [20]:
pd.Series(pd.date_range(start='2020-01-01', periods=10, freq='12H'))

0   2020-01-01 00:00:00
1   2020-01-01 12:00:00
2   2020-01-02 00:00:00
3   2020-01-02 12:00:00
4   2020-01-03 00:00:00
5   2020-01-03 12:00:00
6   2020-01-04 00:00:00
7   2020-01-04 12:00:00
8   2020-01-05 00:00:00
9   2020-01-05 12:00:00
dtype: datetime64[ns]

In [21]:
data = pd.DataFrame(
    {
        'group': ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'c'],
        'data': [4, 3, 2, 1, 12, 3, 4, 5, 7]
    }
)

In [22]:
data

  group  data
0     a     4
1     a     3
2     a     2
3     b     1
4     b    12
5     b     3
6     c     4
7     c     5
8     c     7

##### 值排序, group升序，data降序

In [25]:
data.sort_values(by=['group', 'data'], ascending=[False, True], inplace=True)

In [26]:
data

  group  data
6     c     4
7     c     5
8     c     7
3     b     1
5     b     3
4     b    12
2     a     2
1     a     3
0     a     4

In [31]:
data = pd.DataFrame(
    {
        'k1': ['one'] * 3 + ['two'] * 4,
        'k2': [3, 2, 3, 4, 4, 6, 7]
    }
)

In [32]:
data

    k1  k2
0  one   3
1  one   2
2  one   3
3  two   4
4  two   4
5  two   6
6  two   7

In [33]:
data.sort_values(by='k2')

    k1  k2
1  one   2
0  one   3
2  one   3
3  two   4
4  two   4
5  two   6
6  two   7

##### 去除重复值

In [34]:
data.drop_duplicates()

    k1  k2
0  one   3
1  one   2
3  two   4
5  two   6
6  two   7

##### 指定按某列的去值

In [36]:
data.drop_duplicates(subset='k1')

    k1  k2
0  one   3
3  two   4

In [37]:
data = pd.DataFrame(
    {
        'food': ['A1', 'A2', 'B1', 'B2', 'C1', 'C2'],
        'data': [1, 2, 3, 4, 5, 6]
    }
)

In [38]:
data

  food  data
0   A1     1
1   A2     2
2   B1     3
3   B2     4
4   C1     5
5   C2     6

##### 进行同类项合并

In [46]:
def food_map(series):
    if series.startswith('A'):
        return 'A'
    elif series.startswith('B'):
        return 'B'
    else:
        return 'C'

def food_apply(series):
    if series['food'].startswith('A'):
        return 'A'
    elif series['food'].startswith('B'):
        return 'B'
    else:
        return 'C'

data['food_map'] = data['food'].map(food_map)
data['food_apply'] = data.apply(food_apply, axis='columns')

In [47]:
data

  food  data food_map food_apply
0   A1     1        A          A
1   A2     2        A          A
2   B1     3        B          B
3   B2     4        B          B
4   C1     5        C          C
5   C2     6        C          C

In [2]:
import numpy as np

In [49]:
df = pd.DataFrame(
    {
        'data1': np.random.randn(5),
        'data2': np.random.randn(5)
    }
)

#### 构造一个新的列

In [55]:
new_df = df.assign(ration=df['data1']/df['data2'])

#### 去掉某列

In [58]:
new_df.drop('ration', axis=1, inplace=True)

In [57]:
new_df

      data1     data2    ration
0  0.905812  0.841115  1.076918
1  0.330592 -0.196921 -1.678807
2  1.134739  0.126085  8.999802
3 -0.900930 -2.371051  0.379971
4  0.951051 -0.930724 -1.021841

##### 替换某个值

In [59]:
data = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [60]:
data.replace(9, np.nan, inplace=True)

In [61]:
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
8    NaN
dtype: float64

##### 离散化

In [62]:
ages = [15, 18, 20, 21, 22, 34, 41, 52, 63, 79]
bins = [10, 40, 80]
bins_res = pd.cut(ages, bins)

In [63]:
bins_res

[(10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (40, 80], (40, 80], (40, 80], (40, 80]]
Categories (2, interval[int64]): [(10, 40] < (40, 80]]

In [70]:
bins_res.value_counts()

(10, 40]    6
(40, 80]    4
dtype: int64

In [71]:
ages = [15, 18, 20, 21, 22, 34, 41, 52, 63, 79]
bins = [10, 30, 50, 80]
group_names = ['Yonth', 'Mille', 'Old']
bins_res = pd.cut(ages, bins, labels=group_names)

In [72]:
bins_res.value_counts()

Yonth    5
Mille    2
Old      3
dtype: int64

#### groupby

In [3]:
df = pd.DataFrame(
    {
        'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
        'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C': np.random.randn(8),
        'D': np.random.randn(8)
    }
)

In [4]:
df

     A      B         C         D
0  foo    one  0.012757  0.046330
1  bar    one -0.533986  2.152102
2  foo    two -0.405010 -1.174257
3  bar  three -0.134666 -1.382549
4  foo    two -0.235251  0.785449
5  bar    two -0.826846 -1.706425
6  foo    one -0.687980  0.959579
7  foo  three  0.209268  0.039832

##### 按A列的值进行分组

In [5]:
grouped = df.groupby('A')

In [6]:
grouped.count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [7]:
grouped.sum()

            C         D
A
bar -1.495498 -0.936872
foo -1.106216  0.656933

##### 按A，B两列的值分组

In [8]:
grouped = df.groupby(['A', 'B'])

In [9]:
grouped.count()

           C  D
A   B
bar one    1  1
    three  1  1
    two    1  1
foo one    2  2
    three  1  1
    two    2  2

In [15]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'a'
    else:
        return 'b'
grouped = df.groupby(get_letter_type, axis=1)

In [13]:
grouped.count()

   a  b
0  1  3
1  1  3
2  1  3
3  1  3
4  1  3
5  1  3
6  1  3
7  1  3

In [21]:
s = pd.Series(
    [1, 2, 3, 1, 2, 3],
    [8, 7, 5, 8, 7, 5]
)

In [22]:
grouped = s.groupby(level=0)

In [23]:
grouped.first()

5    3
7    2
8    1
dtype: int64

In [24]:
grouped.sum()

5    6
7    4
8    2
dtype: int64

In [25]:
df = pd.DataFrame(
    {
        'X': ['A', 'B', 'C', 'A', 'B', 'C'],
        'Y': [1, 2, 3, 4, 5, 6]
    }
)

In [26]:
df

   X  Y
0  A  1
1  B  2
2  C  3
3  A  4
4  B  5
5  C  6

#### 按X列的值分组， 只关注A

In [27]:
df.groupby('X').get_group('A')

   X  Y
0  A  1
3  A  4

#### 多重索引

In [29]:
arrays = [
    ['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
    ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']
]

In [30]:
index = pd.MultiIndex.from_arrays(arrays, names=['first', 'second'])

In [31]:
s = pd.Series(np.random.randn(8), index=index)

In [32]:
s

first  second
bar    one       0.627211
       two       0.117004
baz    one       1.897773
       two       2.388540
foo    one       0.378890
       two      -1.358518
qux    one       1.198131
       two      -0.047429
dtype: float64

#### 多重索引的分组

In [33]:
grouped = s.groupby(level=0)

In [34]:
grouped.sum()

first
bar    0.744215
baz    4.286313
foo   -0.979628
qux    1.150702
dtype: float64

In [35]:
grouped = s.groupby(level=1)

In [36]:
grouped.sum()

second
one    4.102006
two    1.099596
dtype: float64

#### 聚合

In [38]:
df = pd.DataFrame(
    {
        'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
        'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C': np.random.randn(8),
        'D': np.random.randn(8)
    }
)

In [39]:
grouped = df.groupby(['A', 'B'])
grouped.aggregate(np.sum)

                  C         D
A   B
bar one   -1.021748 -0.027517
    three  0.730562  0.375158
    two    0.383745  1.301514
foo one    0.991435  1.045975
    three  1.031468  1.789149
    two    2.236332  0.210295

In [41]:
grouped = df.groupby(['A', 'B'], as_index=False)
grouped.aggregate(np.sum)

     A      B         C         D
0  bar    one -1.021748 -0.027517
1  bar  three  0.730562  0.375158
2  bar    two  0.383745  1.301514
3  foo    one  0.991435  1.045975
4  foo  three  1.031468  1.789149
5  foo    two  2.236332  0.210295

In [42]:
grouped = df.groupby(['A', 'B'])
grouped.size()

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

In [46]:
grouped.describe()

              C                                                              \
          count      mean       std       min       25%       50%       75%
A   B
bar one     1.0 -1.021748       NaN -1.021748 -1.021748 -1.021748 -1.021748
    three   1.0  0.730562       NaN  0.730562  0.730562  0.730562  0.730562
    two     1.0  0.383745       NaN  0.383745  0.383745  0.383745  0.383745
foo one     2.0  0.495718  1.871226 -0.827439 -0.165861  0.495718  1.157296
    three   1.0  1.031468       NaN  1.031468  1.031468  1.031468  1.031468
    two     2.0  1.118166  0.509488  0.757904  0.938035  1.118166  1.298297

                        D                                                    \
                max count      mean       std       min       25%       50%
A   B
bar one   -1.021748   1.0 -0.027517       NaN -0.027517 -0.027517 -0.027517
    three  0.730562   1.0  0.375158       NaN  0.375158  0.375158  0.375158
    two    0.383745   1.0  1.301514       NaN  1.301514  1.301514  1.301514
foo one    1.818874   2.0  0.522988  0.468088  0.191999  0.357493  0.522988
    three  1.031468   1.0  1.789149       NaN  1.789149  1.789149  1.789149
    two    1.478428   2.0  0.105147  0.395839 -0.174753 -0.034803  0.105147


                75%       max
A   B
bar one   -0.027517 -0.027517
    three  0.375158  0.375158
    two    1.301514  1.301514
foo one    0.688482  0.853976
    three  1.789149  1.789149
    two    0.245097  0.385048

In [47]:
grouped = df.groupby('A')
grouped['C'].agg([np.sum, np.mean, np.std])

          sum      mean       std
A
bar  0.092559  0.030853  0.927926
foo  4.259236  0.851847  1.023332

In [48]:
s = pd.Series(['a_b_c', 'c_d_e', 'f_g_h'])

In [49]:
s

0    a_b_c
1    c_d_e
2    f_g_h
dtype: object

In [50]:
s.str.split('_')

0    [a, b, c]
1    [c, d, e]
2    [f, g, h]
dtype: object

In [51]:
s.str.split('_', expand=True)

   0  1  2
0  a  b  c
1  c  d  e
2  f  g  h